# Pandas COMP2420 VS The World

None of these pandas things are "important" compared to anything else as such, they're just useful little tips that could pay off in an exam.

In [74]:
import pandas as pd
import numpy as np

In [94]:
df = pd.DataFrame({
    'x': [1, 2, 3, 4, 5, 6],
    'y': [6, 5, 4, 3, 2, 1]
})

display(df) # render a DataFrame nicely

df.info() # get the basic memory-level info about a DataFrame

df.describe() # get the statistical level information about a DataFrame

   x  y
0  1  6
1  2  5
2  3  4
3  4  3
4  5  2
5  6  1

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
x    6 non-null int64
y    6 non-null int64
dtypes: int64(2)
memory usage: 176.0 bytes

              x         y
count  6.000000  6.000000
mean   3.500000  3.500000
std    1.870829  1.870829
min    1.000000  1.000000
25%    2.250000  2.250000
50%    3.500000  3.500000
75%    4.750000  4.750000
max    6.000000  6.000000

In [95]:
df = pd.DataFrame({
    'number': np.arange(100)
})

display(df.head(5))
display(df.tail(5))

df2 = pd.DataFrame({
    'number': np.arange(110)
})

df3 = df.append(df2)

display(len(df3))

   number
0       0
1       1
2       2
3       3
4       4

    number
95      95
96      96
97      97
98      98
99      99

210

In [96]:
data = pd.DataFrame({
    'x': [0, 1, 2],
    'date': ['2019-03-08', '2018-04-22', '2010-12-06']
})

data['date'] = data['date'].str.split("-", expand=True)

data

   x  date
0  0  2019
1  1  2018
2  2  2010

In [97]:
df = pd.DataFrame({
    'potatoes': [
        1,
        2,
        3,
        4,
        5,
        None,
        6,
        None
    ]
})

df['potatoes'] = df['potatoes'].fillna(df['potatoes'].mean())

df

   potatoes
0       1.0
1       2.0
2       3.0
3       4.0
4       5.0
5       3.5
6       6.0
7       3.5

In [98]:
df = pd.DataFrame({
    'name': [
        'Harrison',
        'Harrison',
        'Oliver',
        'Josh',
        'Harrison'
    ],
    'activity': [
        'Shooting',
        'Shooting',
        'Fishing',
        'Farming',
        'Shooting'
    ]
})

df.groupby('name')['activity'].value_counts()

name      activity
Harrison  Shooting    3
Josh      Farming     1
Oliver    Fishing     1
Name: activity, dtype: int64

## General Python Tips

In [8]:
print("33/8 rounded to 2 decimal places:", round(33/8, 2))

from itertools import combinations 
fruit = ['apple', 'pear', 'tomato', 'watermelon', 'banana']
print("Each combination of two fruits:", list(combinations(fruit, 2)))

33/8 rounded to 2 decimal places: 4.12
Each combination of two fruits: [('apple', 'pear'), ('apple', 'tomato'), ('apple', 'watermelon'), ('apple', 'banana'), ('pear', 'tomato'), ('pear', 'watermelon'), ('pear', 'banana'), ('tomato', 'watermelon'), ('tomato', 'banana'), ('watermelon', 'banana')]